Revit 2027 API
DeleteWorksetSettings Constructor
 Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DeleteWorksetSettings()
Public Sub New
public:
DeleteWorksetSettings()
new : unit -> DeleteWorksetSettings
See Also
Reference
DeleteWorksetSettings Class
DeleteWorksetSettings Overload
Autodesk.Revit.DB Namespace